# Վարժություն 1․1
# Ինչ կպատասխանի ինտերպրետատորը արտահայտություններից յուրաքանչյուրին
# >>> 10
# 10
# >>> 5 + 3 + 12
# 20
# >>> 9 - 2
# 7
# >>> 20 / 2
# 10․0
# >>> (4 * 2) - (2 * 3)
# 2
# >>> a = 3
# >>> b = a + 1
# >>> a + b + (a * b)
# 19

# Վարժություն 1․3
# Ստեղծեք ֆունկցիա,որը որպես արգումենտ ստանում է երեք թվեր և վերադարձնում դրանցից երկու մեծագույնների քառակուսիների գումարը

def sum_of_two_squares(a, b, c):
    if a >= b >= c:
        x = a
        y = b
    elif b >= c >= a:
        x = b
        y = c
    else:
        x = a
        y = c

    return (x**2) + (y**2)


print(sum_of_two_squares(5, 4, 1))

# Վարժություն 1․4
# Նկարագրեք հետևյալ ֆունկցիայի աշխատանքը

def a_plus_abs_b(a, b):
    if b > 0:
        return a + b
    else:
        return a - b


# Մեր ֆունկցիան անում է հետևյալ գործողությունները․եթե b թիվը մեծ ե 0-ից (if b > 0), վերադարձնի a-ի և b-ի absolute արժեքի գումարը(return a + b),
# իսկ մնացած բոլոր դեպքերում (else b > 0) վերադարձնում a - b(return a - b)

def a_plus_abs_b(a, b):
    if b > 0:
        return a + b
    return a - b

# Նույնն է ինչ վերևի ֆունկցիան ուղղակի ավելի կարճ․այսինքն եթե բավարարվում է if-ը(b > 0) ապա վերադարձնոմ է a + b ու դրանից հետո
# իսկ եթե if-ի մեջ չի մտնում այսինքն չի բավարարվում b > 0 պայմանը ապա return a - b

